---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenFailureError
source: html/4fabec67-0a7f-4781-963a-0b0829299413.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FormFailures.FormElemRegenFailureError Property

Unable to create form element

## Syntax (C#)
```csharp
public static FailureDefinitionId FormElemRegenFailureError { get; }
```